---
kind: other
id: Methods.T:Autodesk.Revit.DB.PerformanceAdviser
source: html/215a0cad-afee-478a-6c06-136433ee6eac.htm
---
# PerformanceAdviser Methods

Adds a performance adviser rule to the list of rules.